{
    "count": 206,
    "next": "https://www.udemy.com/api-2.0/users/me/subscribed-courses/?fields%5Bcourse%5D=completion_ratio%2Cenrollment_time%2Clast_accessed_time%2Cnum_collections%2Cpublished_title%2Ctitle%2Ctracking_id%2Curl%2Cdescription%2Cvisible_instructors&fields%5Buser%5D=%40min%2Cjob_title&is_archived=false&ordering=-last_accessed&page=10&page_size=12",
    "previous": "https://www.udemy.com/api-2.0/users/me/subscribed-courses/?fields%5Bcourse%5D=completion_ratio%2Cenrollment_time%2Clast_accessed_time%2Cnum_collections%2Cpublished_title%2Ctitle%2Ctracking_id%2Curl%2Cdescription%2Cvisible_instructors&fields%5Buser%5D=%40min%2Cjob_title&is_archived=false&ordering=-last_accessed&page=8&page_size=12",
    "results": [
      {
        "_class": "course",
        "id": 3016040,
        "title": "Hands On Presto Mastery - Learn by doing!",
        "url": "/course/the-ultimate-hands-on-presto-course/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 43771,
            "title": "CurvedArrow LLC",
            "name": "CurvedArrow",
            "display_name": "CurvedArrow LLC",
            "job_title": "Big Data Specialist"
          }
        ],
        "published_title": "the-ultimate-hands-on-presto-course",
        "tracking_id": "ambV0nshQYukV3yxX_jdsw",
        "description": "<p>Welcome to my Presto course - Hands On Presto Mastery - Learn by doing!. I want to first of all thank you for considering this course. Without you the student, I will not be able to create this course.</p><p>Big Data is very hot at the moment and Presto is one of the exciting projects in the Big Data ecosystem. Presto is a distributed query engine that excels at crunching petabytes of data efficiently and low latency analytics.</p><p>This Presto course contains everything you need to get started with Presto. We will go from zero to Presto in this single course and back it up with a lot of hands on work. By the end of this course, you will be full of confidence, skilled up and ready to take your career to the next level. So let's buckle up and lean in</p><p>In this course, we will wear many hats as we solve an end to end Big Data problem:</p><ol><li><p><strong>Product Hat:</strong> We will start with a real world scenario and dive into the user segments and pain points.</p></li><li><p><strong>Architect&nbsp;Hat:</strong> Once we understand the pain points, we will architect a Presto based solution to address those pain points</p></li><li><p><strong>Engineer Hat: </strong>Once we have that, we will then install and setup Presto. We will cover the fundamentals – coordinator, worker, connectors etc. </p></li><li><p><strong>Engineer Hat:</strong> One nice thing is that presto forces you to interact with other projects in the Big Data ecosystem.</p><ol><li><p>And so, to visualize data, we will setup clients like the Presto CLI, RStudio and Tableau.</p></li><li><p>For storage, we will setup data sources like the MySQL&nbsp;DB, Kafka and HDFS. Presto is strictly a compute engine and this means that it does not have its own storage.</p></li></ol></li><li><p><strong>Engineer Hat:</strong> Once we are done, we will demo the final product and show you how to join data from multiple data sources in a single query. </p></li></ol><p>At the end of this journey, we will deliver a solution that solves the pain points identified earlier. </p>",
        "completion_ratio": 0,
        "last_accessed_time": "2022-03-11T06:52:08Z",
        "enrollment_time": "2021-10-15T13:19:43Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 4175968,
        "title": "Writing production-ready ETL pipelines in Python / Pandas",
        "url": "/course/writing-production-ready-etl-pipelines-in-python-pandas/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 46915140,
            "title": "Jan Schwarzlose",
            "name": "Jan",
            "display_name": "Jan Schwarzlose",
            "job_title": "Data Engineer aus Leidenschaft"
          }
        ],
        "published_title": "writing-production-ready-etl-pipelines-in-python-pandas",
        "tracking_id": "vrBhSYO8RHWQLkxSQHEIkg",
        "description": "<p>This course will show each step to write an ETL pipeline in Python from scratch to production using the necessary tools such as Python 3.9, Jupyter Notebook, Git and Github, Visual Studio Code, Docker and Docker Hub<strong> </strong>and the Python packages Pandas, boto3, pyyaml, awscli, jupyter, pylint, moto, coverage and the memory-profiler.</p><p>Two different approaches how to code in the Data Engineering field will be introduced and applied - functional and object oriented programming.</p><p>Best practices in developing Python code will be introduced and applied: </p><ul><li><p>design principles</p></li><li><p>clean coding</p></li><li><p>virtual environments</p></li><li><p>project/folder setup</p></li><li><p>configuration</p></li><li><p>logging</p></li><li><p>exeption handling</p></li><li><p>linting</p></li><li><p>dependency management</p></li><li><p>performance tuning with profiling</p></li><li><p>unit testing</p></li><li><p>integration testing</p></li><li><p>dockerization</p></li></ul><p><br></p><p><strong>What is the goal of this course?</strong></p><p>In the course we are going to use the Xetra dataset. Xetra stands for Exchange Electronic Trading and it is the trading platform of the Deutsche Börse Group. This dataset is derived near-time on a minute-by-minute basis from Deutsche Börse’s trading system and saved in an AWS S3 bucket available to the public for free. </p><p>The ETL Pipeline we are going to create will extract the Xetra dataset from the AWS S3 source bucket on a scheduled basis, create a report using transformations and load the transformed data to another AWS S3 target bucket. </p><p>The pipeline will be written in a way that it can be deployed easily to almost any production environment that can handle containerized applications. The production environment we are going to write the ETL pipeline for consists of a GitHub Code repository, a DockerHub Image Repository, an execution platform such as Kubernetes and an Orchestration tool such as the container-native Kubernetes workflow engine Argo Workflows or Apache Airflow.</p><p><br></p><p><strong>So what can you expect in the course?</strong></p><p>You will receive primarily practical interactive lessons where you have to code and implement the pipeline and theory lessons when needed. Furthermore you will get the python code for each lesson in the course material, the whole project on GitHub and the ready to use docker image with the application code on Docker Hub.</p><p>There<strong> </strong>will be power point slides for download for each theoretical lesson and useful links for each topic and step where you find more information and can even dive deeper.</p><p><br></p>",
        "completion_ratio": 0,
        "last_accessed_time": "2022-03-11T06:12:12Z",
        "enrollment_time": "2021-10-18T05:24:50Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 4239988,
        "title": "Data Engineering using Kafka and Spark Structured Streaming",
        "url": "/course/data-engineering-using-kafka-and-spark-structured-streaming/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 22663786,
            "title": "Durga Viswanatha Raju Gadiraju",
            "name": "Durga Viswanatha Raju",
            "display_name": "Durga Viswanatha Raju Gadiraju",
            "job_title": "CEO at ITVersity and CTO at Analytiqs, Inc"
          }
        ],
        "published_title": "data-engineering-using-kafka-and-spark-structured-streaming",
        "tracking_id": "UIf6Uss1RBaBCTOPY4a1Qg",
        "description": "<p>As part of this course, you will be learning to build streaming pipelines by integrating Kafka and Spark Structured Streaming. Let us go through the details about what is covered in the course.</p><ul><li><p>First of all, we need to have the proper environment to build streaming pipelines using Kafka and Spark Structured Streaming on top of Hadoop or any other distributed file system. As part of the course, you will start with setting up a self-support lab with all the key components such as Hadoop, Hive, Spark, and Kafka on a single node Linux-based system.</p></li><li><p>Once the environment is set up you will go through the details related to getting started with Kafka. As part of that process, you will create a Kafka topic, produce messages into the topic as well as consume messages from the topic.</p></li><li><p>You will also learn how to use Kafka Connect to ingest data from web server logs into Kafka topic as well as ingest data from Kafka topic into HDFS as a sink.</p></li><li><p>Once you understand Kafka from the perspective of Data Ingestion, you will get an overview of some of the key concepts of related Spark Structured Streaming.</p></li><li><p>After learning Kafka and Spark Structured streaming separately, you will build a streaming pipeline to consume data from Kafka topic using Spark Structured Streaming, then process and write to different targets.</p></li><li><p>You will also learn how to take care of incremental data processing using Spark Structured Streaming.</p></li></ul><p><strong>Course Outline</strong></p><p>Here is a brief outline of the course. You can choose either Cloud9 or GCP&nbsp;to provision a server to set up the environment.</p><ul><li><p>Setting up Environment using AWS Cloud9 or GCP</p></li><li><p>Setup Single Node Hadoop Cluster</p></li><li><p>Setup Hive and Spark on top of Single Node Hadoop Cluster</p></li><li><p>Setup Single Node Kafka Cluster on top of Single Node Hadoop Cluster</p></li><li><p>Getting Started with Kafka</p></li><li><p>Data Ingestion using Kafka Connect - Web server log files as a source to Kafka Topic</p></li><li><p>Data Ingestion using Kafka Connect - Kafka Topic to HDFS a sink</p></li><li><p>Overview of Spark Structured Streaming</p></li><li><p>Kafka and Spark Structured Streaming Integration</p></li><li><p>Incremental Loads using Spark Structured Streaming</p></li></ul><p><strong>Udemy based support</strong></p><p>In case you run into technical challenges while taking the course, feel free to raise your concerns using Udemy Messenger. We will make sure that issue is resolved in 48 hours.</p>",
        "completion_ratio": 0,
        "last_accessed_time": "2022-03-11T06:07:33Z",
        "enrollment_time": "2021-11-18T19:28:58Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 1520628,
        "title": "AWS Certified Solutions Architect Associate Practice Exams",
        "url": "/course/aws-certified-solutions-architect-associate-amazon-practice-exams-saa-c03/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 116422,
            "title": "Jon Bonso | AWS Certified Solutions Architect Professional",
            "name": "Jon",
            "display_name": "Jon Bonso | AWS Certified Solutions Architect Professional",
            "job_title": "10x AWS Certified Solutions Architect Professional"
          },
          {
            "_class": "user",
            "id": 47074526,
            "title": "Tutorials Dojo | AWS Certified Cloud Practitioner, AWS Certified Solutions Architect, AWS Certified Developer",
            "name": "Tutorials Dojo | AWS Certified Cloud Practitioner,",
            "display_name": "Tutorials Dojo | AWS Certified Cloud Practitioner, AWS Certified Solutions Architect, AWS Certified Developer",
            "job_title": "AWS Certifications, Azure Certifications, Google Cloud"
          }
        ],
        "published_title": "aws-certified-solutions-architect-associate-amazon-practice-exams-saa-c03",
        "tracking_id": "RjoJD8W5SbOS0-8w6UsdyQ",
        "description": "<p>These AWS Certified Solutions Architect - Associate SAA-C03 practice tests are patterned after the latest exam format and were crafted based on the feedback of our <strong>100,000+ students </strong>on what appeared in the actual exam. Our AWS Certified Solutions Architect practice tests are TOP-NOTCH and the CLOSEST to the actual exam, as demonstrated by over 20,000++ reviews on our course<strong>. </strong></p><p>-&nbsp; Each question has <strong>detailed explanations </strong>at the end of each set<strong> </strong>that will help you gain a deeper understanding of the AWS services.<strong>&nbsp; </strong></p><p>- The explanation provides an overview of the topic, reference links to AWS documentation, and a rationale on why the option is correct or incorrect </p><p>-&nbsp; <strong>MOBILE-COMPATIBLE</strong> - so you can conveniently review everywhere, anytime with your smartphone! </p><p>-&nbsp; <strong>FREE EXCLUSIVE 3-MONTH&nbsp;ACCESS TO THE TUTORIALS DOJO PORTAL - EXAM SIMULATOR</strong>&nbsp; (registration required) - An optional feature that contains a Review-mode that lets you see the answers right away as you go through each question, plus bonus Flashcards! </p><p><br></p><p><strong>FREQUENTLY&nbsp;ASKED&nbsp;QUESTIONS:</strong></p><p><strong>Is this updated to the new SAA-C03 exam version?</strong></p><ul><li><p>Yes, it is.&nbsp; You can verify our content by checking the official Exam Guide for the AWS&nbsp;Certified Solutions Architect - Associate exam from the AWS&nbsp;Certification website. Check the Appendix section of the Exam Guide, and you will a list of all relevant AWS&nbsp;Services for the SAA-C03 exam version.&nbsp; We have covered these new AWS services on our practice exams, and we are always updating our content.</p></li></ul><p><strong>Can I take the SAA-C03 exam online at my home?</strong></p><ul><li><p>Yes, you can take the new SAA-C03 exam, as well as the other AWS certification exams in the comforts of your home. </p></li></ul><p><strong>How can I schedule my SAA-C03 exam?</strong></p><ul><li><p>You can go to the official AWS Solutions Architect Associate Certification page and then click the “Schedule Exam” button to book your SAA-C03 test. Alternatively, you can directly log in to your AWS Certification account to schedule the exam.</p></li></ul><p><strong>Is this an exam dump for the AWS&nbsp;Certified Solutions Architect - Associate SAA-C03 exam?</strong></p><ul><li><p>No, it isn't. AWS&nbsp;is always updating its exam content, and thus, the exam dumps you are seeing over the Internet are mostly inaccurate and outright illegal. The provided answers are wrong, and you are not provided with the proper explanations as to why an option is correct or not.</p></li><li><p>We write our own practice exam content based on the official SAA-C03 Exam Guide and on our own AWS exam experience. If you are looking for exam dumps for the SAA-C03 exam, please look somewhere else because this course is definitely NOT for you. </p></li></ul><p><br></p><p>The <strong>AWS Certified Solutions Architect Associate</strong> is consistently among the top-paying IT certifications, considering that <strong>Amazon Web Services</strong> (AWS) is the leading cloud services platform in the world with almost 50% market share! Earn over $150,000 per year with an AWS Solutions Architect certification!</p><p>But before you become an AWS Certified Solutions Architect Professional, it is recommended for you to pass the AWS Solutions Architect Associate certification exam first, and this is where AWS practice tests come in. It is possible that you have read all of the available AWS documentation online yet still fail the exam! These AWS practice tests simulate the actual certification exam and ensure that you indeed understand the subject matter. </p><p><br></p><p>This <strong>AWS Certified Solutions Architect Associate ( SAA-C03 ) Practice Exam</strong> course offers the following features:</p><p><br></p><ol><li><p><strong>FULLY&nbsp;UPDATED&nbsp;TO&nbsp;THE&nbsp;&nbsp;SAA-C03 version</strong>-&nbsp; Most practice tests out there are already obsolete and advertised as \"updated\", but in reality, they are not! We have already integrated the new SAA-C03 topics such as Amazon Detective, AWS Global Accelerator, Amazon FSx for Lustre, Amazon EKS&nbsp;Anywhere, AWS&nbsp;Proton, and many more in our sets. The content of this practice test will also be updated to reflect the new SAA-C03 topics.</p><p><br></p></li><li><p><strong>390 TOP-NOTCH Questions</strong> - has 6 sets of AWS Practice Tests with 65 UNIQUE questions and a 130-minute time limit for each set.</p><p><br></p></li><li><p><strong>SIMULATES ACTUAL EXAM ENVIRONMENT</strong> - mimics the actual and the latest AWS Solutions Architect - Associate SAA-C03 certification exam to help you pass and even ace the AWS exam!</p><p><br></p></li><li><p><strong>FREE EXCLUSIVE 3-MONTH&nbsp;ACCESS TO THE TUTORIALS DOJO PORTAL - EXAM SIMULATOR</strong> - with a <strong>\"Review-Mode\"</strong> where you can see the answers right away as you go through each question, plus other training modes and perks! It also has a bonus Flash Cards set to help you with your learning. This is an optional feature, and registration is required to access the simulator (using your name and email address). Kindly send us a direct message here on Udemy to request access.</p><p><br></p></li><li><p><strong>DETAILED EXPLANATIONS, REFERENCE LINKS, AND CHEAT SHEETS</strong> - our answer keys at the end of each set have full and detailed explanations along with complete reference links so you can check and verify that the answers are correct. Plus bonus cheat sheets to help you better understand the concepts.</p><p><br></p></li><li><p><strong>ACTIVE Q&amp;A DISCUSSION BOARD</strong> - with inputs from the instructors and exam feedback from thousands of our students, our Q&amp;A board gives you the opportunity to <strong>know which topics recently appeared on the exam</strong> and better understand the AWS services and concepts covered in the test.</p><p><br></p></li><li><p><strong>RESPONSIVE INSTRUCTORS</strong> - our friendly team of AWS experts is able to address all your issues and COMPREHENSIVELY answer all your questions within 5 business days.</p><p><br></p></li><li><p><strong>CONTAINS A TEST REPORT</strong> - to track your progress and show you which AWS knowledge areas you need improvement.</p><p><br></p></li><li><p><strong>MOBILE-COMPATIBLE</strong> - so you can conveniently review everywhere, anytime with your smartphone!</p><p><br></p></li><li><p><strong>RANDOMIZED QUESTIONS</strong> - The scenarios and options on all 6 practice tests are randomized. This prevents the unconscious memorization of the answers and ensures that you fully understand the concepts.</p><p><br></p></li><li><p><strong>HAS BETTER VALUE THAN THE OFFICIAL AWS PRACTICE TEST</strong> - which is accessible from the AWS&nbsp;Skill Builder portal for about $29 per month but only contains about 20 - 40 questions, compared with our 300+ questions.</p><p><br></p></li><li><p><strong>CLEAR AND ERROR-FREE QUESTIONS</strong> - Each item has reference links to the official AWS&nbsp;Documentation that can validate our provided answer, but you can also post in the QA section so we can discuss any issues.</p><p><br></p></li><li><p><strong>Prepared by an AWS Certified Solutions Architect Professional </strong>who has actually passed the actual SAA-C03 exam! (Please see my LinkedIn profile to view my AWS Certificate)</p></li></ol><p><br></p><p>In addition to these 6 practice test sets for the SAA-C03 exam, we also offer <strong>FREE</strong> access to the SAA-C03 Exam Simulator in our Tutorials Dojo portal just as mentioned above. This unique Exam Simulator contains additional features that are currently not present in the Udemy platform including a Review Mode where you can see the answers right away as you go through each question, plus BONUS flashcards which are visual aids containing some important concepts that you need to know before taking the exam. </p><p><strong>NOTE:</strong> You will find the link to the exam simulator as well as the access details via our Welcome Message, which you will receive once you enroll in our course. If you can't see our Welcome Message, kindly send us a direct/private message here on&nbsp;Udemy to request access. Someone from our team will respond with details on how to access the Exam Simulator within 3-5 business days. Take note that this is just an <strong>OPTIONAL</strong> feature, and registration is required in the Tutorials Dojo portal (using your name and email address) once you receive your access details. </p><p><br></p><p>These practice exams are designed to focus on the important exam topics (such as EC2, EBS, S3, and many others) hence, the aforementioned topics have more questions than the other AWS knowledge areas. The number of questions on each topic is carefully selected based on the 4 domains of the actual AWS certification exam.</p><p>Some people are using brain dumps or exam dumps for the <strong>AWS Certified Solutions Architect - Associate</strong> <strong>SAA-C03 </strong>certification exam, which is totally absurd and highly unprofessional because those exam dumps will hinder you from attaining in-depth AWS knowledge. It can also result in you failing the actual AWS certification exam since Amazon regularly updates the exam coverage.</p><p>Please also note that these <strong>AWS Certified Solutions Architect - Associate practice tests</strong> <strong>SAA-C03 </strong>are not exam dumps and since Amazon shuffles the actual exam content from a question bank with hundreds to thousands of questions, it is nearly impossible to match what you can see here with the actual tests. Again, the key to passing the exam is a good understanding of AWS services and this is what our AWS Certified Solutions Architect Associate SAA-C03<strong> </strong>practice tests are meant to do.</p><p>There are a lot of existing <strong>AWS Practice Tests</strong> in the market however, most of them contain both technical and grammatical errors that may cause you to fail the actual exam. There are also official certification practice exams provided by AWS but these only have 20 or 40 questions and cost 20 or 30 USD -- a price that is comparable with having these 390 Unique and Timed Amazon Web Services practice questions! </p><p>When I was reviewing for my <strong>AWS Certified Solutions Architect Associate</strong> exam, I had a hard time finding comprehensive practice tests to help me pass my exam. I bought some of them in the market, but I was disappointed because there were a lot of technical and grammatical errors in the practice questions. This is why I created these AWS practice tests to help my fellow IT professionals in the industry. </p><p>We gave a considerable amount of effort to creating and publishing these AWS practice tests, including the laborious task of checking each item for any errors. We are confident that this will significantly help you pass your SAA-C03 exam. And we don't need to trash or slander other AWS practice test courses here on Udemy just to make a sale because we are confident that our AWS practice tests are simply the <strong>BEST</strong>.</p><p><br></p><p><strong>IMPORTANT NOTE</strong> </p><p>These AWS Certified Solutions Architect Associate practice exams for the new SAA-C03 version have a passing score of 72%, but I highly encourage you to repeat taking these exams again and again until you consistently reach a score of 90% or higher on each exam. </p><p>Remember that using this product alone does not guarantee you will pass the AWS exam, as you still need to do your own readings and hands-on exercises in AWS. Nonetheless, these Amazon Web Services practice exams provide a comprehensive assessment of which knowledge area you need improvement on and even help you achieve a higher score!</p><p>AWS&nbsp;always updates the content of their AWS&nbsp;Certification exam. This is why we regularly update the content of this practice tests reviewer to be on par with the new SAA-C03 version.</p>",
        "completion_ratio": 17,
        "last_accessed_time": "2022-03-11T06:07:16Z",
        "enrollment_time": "2021-10-18T05:24:50Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 4015622,
        "title": "100 Days Of Code - 2023 Web Development Bootcamp",
        "url": "/course/100-days-of-code-web-development-bootcamp/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 31926668,
            "title": "Academind by Maximilian Schwarzmüller",
            "name": "Academind by Maximilian",
            "display_name": "Academind by Maximilian Schwarzmüller",
            "job_title": "Online Education"
          },
          {
            "_class": "user",
            "id": 13952972,
            "title": "Maximilian Schwarzmüller",
            "name": "Maximilian",
            "display_name": "Maximilian Schwarzmüller",
            "job_title": "AWS certified, Professional Web Developer and Instructor"
          },
          {
            "_class": "user",
            "id": 30035496,
            "title": "Manuel Lorenz",
            "name": "Manuel",
            "display_name": "Manuel Lorenz",
            "job_title": "Professional Business Analyst and Instructor"
          }
        ],
        "published_title": "100-days-of-code-web-development-bootcamp",
        "tracking_id": "OQFyAfPTQCi0bHi7v8DSzw",
        "description": "<p><strong>Join the most comprehensive web development bootcamp on Udemy!</strong></p><p>This course will teach you web development and <strong>turn you into a web developer in 100 days </strong>- or allow you to <strong>refresh key essentials and expand your existing knowledge!</strong></p><p>Becoming a web developer is a great choice because web development opens up many career paths and web development skills are required in pretty much every business that exists today - and of course this will only increase in the future!</p><p>It's not just about websites - it's also about \"behind the scenes\" services used by mobile apps like Uber or AirBnB. It's about rich web apps like Google Docs as well as browser games. And of course also about regular websites like Facebook, online blogs, online shops like Amazon and much, much more!</p><p>Hence it's no wonder, that web developers are in high demand! And, besides great job perspectives, as a web developer, you can of course also easily build your own digital business!</p><p><strong>This Course Is For You!</strong></p><p>This course will teach you web development<strong> from the ground up</strong> and thanks to the \"100 Days Of Code Challenge\"&nbsp;which is incorporated into this course (though it's optional to commit to it!), you can <strong>become a web developer in 100 days </strong>with help of this course!</p><p><strong>No prior web development knowledge is required</strong> at all to get started with this course.&nbsp;We will explore all important basics, all fundamentals and all key concepts together, step by step.</p><p>But this course is <strong>also for advanced students</strong> who already do&nbsp;have web development knowledge!&nbsp;It's a deep-dive course and hence you will be able to expand your existing knowledge by diving deeper into key fundamentals like HTML, CSS&nbsp;or NodeJS and also by exploring advanced concepts like handling payments, building REST&nbsp;APIs or website security.</p><p>Since it's a huge course, the course is built in a modular way. This means, that you can take it step by step, lecture by lecture but you can also jump right into the course sections that are most interesting to you. Of course, we recommend the \"step-by-step\"&nbsp;approach for beginners - simply because all the lectures and sections build up on each other. But as a more experienced developer, you can of course skip basics that aren't interesting to you!</p><p><strong>The 100 Days Of Code Challenge</strong></p><p>We built this course with the \"100 Days Of Code&nbsp;Challenge\" in mind - a challenge (not invented by us) that aims to keep you motivated to code for <strong>at least 1 hour per day for 100 days</strong>.</p><p>Since this is a huge course (with around 80 hours of content!) it can be very overwhelming. And we know that many students never finish a course.</p><p>That's a pitty, because this course is <strong>packed with content, exercises, quizzes, assignments and demo projects</strong>! We build a browser-game, a blog, a travel website, an online shop and much, much more. </p><p>Therefore, we provide clear guidance on how you can take this course from A&nbsp;to Z within 100 days by spending 1 to 2 hours per day watching videos and learning. As part of the course, you get access to a companion website that provides a clear structure and you also find annotations right in the course curriculum. </p><p>Of course taking this \"100&nbsp;Days\"&nbsp;challenge is totally optional though!&nbsp;You can take the course at your own pace as well and skip any content you're not interested in!</p><p><strong>Try It Risk-Free</strong></p><p>This course comes with a <strong>30 day money-back guarantee</strong>. If you find out that it's not for you, you can get your money back, no questions asked!</p><p><strong>What You Will&nbsp;Learn</strong></p><p>This is a huge course, packed with content and it's the web development bootcamp we would have loved to have when we learned web development.</p><p>Here's a summary of the key concepts we'll explore as part of this course:</p><ul><li><p>How the web works</p></li><li><p>Core technologies:&nbsp;HTML, CSS&nbsp;&amp;&nbsp;JavaScript</p></li><li><p>Understand how HTML documents are structured and how HTML&nbsp;elements are used correctly</p></li><li><p>Learn core CSS&nbsp;concepts like the box model, flexbox, positioning, units and much more</p></li><li><p>Explore advanced CSS&nbsp;concepts like building responsive websites, layouts, custom CSS&nbsp;properties, CSS&nbsp;grid &amp;&nbsp;more</p></li><li><p>Learn browser-side JavaScript from the ground up</p></li><li><p>Understand what the \"DOM\"&nbsp;is and how you can manipulate it via JavaScript</p></li><li><p>Explore browser /&nbsp;user events and how to handle them with JavaScript</p></li><li><p>Build tons of projects (e.g. a Tic-Tac-Toe browser game) to practice and fully understand all these technologies</p></li><li><p>Dive into backend development with NodeJS&nbsp;&amp;&nbsp;ExpressJS</p></li><li><p>Learn what NodeJS&nbsp;is and how it works</p></li><li><p>Build basic backend-driven websites with advanced concepts like dynamic routing or dynamic templates</p></li><li><p>Learn how to work with databases - SQL&nbsp;&amp;&nbsp;NoSQL&nbsp;(and what that is)</p></li><li><p>Practice how to use SQL&nbsp;/&nbsp;NoSQL with NodeJS&nbsp;&amp;&nbsp;Express</p></li><li><p>Dive into advanced concepts like authentication, website security, coding patterns, file uploads, user input validation and so much more!</p></li><li><p>Again:&nbsp;Build plenty of projects (e.g. a complete online shop, from the ground up!) to practice all advanced concepts as well</p></li><li><p>Learn how to use third-party packages and services (e.g. Stripe for payments) in your websites</p></li><li><p>Move on to more specialized, advanced concepts like building REST&nbsp;APIs</p></li><li><p>Explore frontend JavaScript frameworks like Vue.js to build even more powerful web user interfaces</p></li><li><p>And so much more - simply check out the full curriculum to get a complete list!</p></li></ul><p><strong>We'd love to start this journey with you, so let's get started!</strong></p><p><em>Max &amp;&nbsp;Manuel</em></p>",
        "completion_ratio": 1,
        "last_accessed_time": "2022-03-11T06:07:00Z",
        "enrollment_time": "2021-11-21T18:10:09Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 2723898,
        "title": "Case Studies for System Design Interviews",
        "url": "/course/case-studies-for-system-design-interviews/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 91310148,
            "title": "Erdem Salihoğlu",
            "name": "Erdem",
            "display_name": "Erdem Salihoğlu",
            "job_title": "Software Engineer"
          }
        ],
        "published_title": "case-studies-for-system-design-interviews",
        "tracking_id": "iQmExp2qR-aWB3Fj2PtNUQ",
        "description": "<p>System design is part of the technical interview process in some companies. It is often a brainstorming session between the interviewer and the interviewee about the design of a software system.</p><p><strong>Format of the Course</strong></p><p>In this course, we study the design of a set of<em> </em>selected software systems with a top-down approach. In each case, we start by defining the requirements, then do a high level design of the system, and then design some of the subsystems.</p><p>The discussions are driven by questions. After each question, you can pause the video and give your own answer to practice for system design interviews. After each question, I give an answer based on my opinion. Since I intent to teach the concept being discussed, my answer might be longer than a regular answer given in an interview.</p><p>Design questions might be open-ended and might have more than one answer.</p><p>For the efficiency of the course, and not to talk about the same concept again and again, each case will include questions on selected concepts.</p><p><strong>Concepts and Techniques</strong></p><p>During this journey, you will encounter both domain specific questions and questions on several design techniques and concepts, such as:</p><ul><li><p>High Level Design</p></li><li><p>Battery Efficiency</p></li><li><p>Request Traffic Analysis</p></li><li><p>Data Analysis</p></li><li><p>Stateless Services</p></li><li><p>Caching</p></li><li><p>Sharding</p></li><li><p>Fast Data Retrieval </p></li><li><p>Webhooks</p></li><li><p>WebSocket</p></li><li><p>Data Management</p></li><li><p>Preventing Overload</p></li><li><p>...</p></li></ul>",
        "completion_ratio": 0,
        "last_accessed_time": "2022-03-11T06:04:11Z",
        "enrollment_time": "2021-10-22T18:45:32Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 802366,
        "title": "REST API Design, Development & Management",
        "url": "/course/rest-api/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 16296260,
            "title": "Rajeev Sakhuja",
            "name": "Rajeev",
            "display_name": "Rajeev Sakhuja",
            "job_title": "11xAWS Certified, Consultant, Mentor, Innovation evangelist"
          }
        ],
        "published_title": "rest-api",
        "tracking_id": "XjSb1YTUQzeF7edGcFpMaA",
        "description": "<p><strong>PS:&nbsp;</strong></p><ul><li><p><strong>This&nbsp;</strong>COURSE&nbsp;does <strong>NOT</strong>&nbsp;focus on <strong><em>Coding</em> </strong>of REST&nbsp;API - Focus is on <strong><em>Designing&nbsp; </em></strong>using proven patterns. </p></li><li><p>Please do NOT&nbsp;enroll if your objective/Goal is just to learn \"Coding\" part of the REST&nbsp;API.</p></li></ul><p><br></p><p><strong>How was this course created?</strong></p><p>Author (Raj) has worked with many large organizations for building their Digital Strategy in which API&nbsp;was a central theme. Over the years author recognized certain patterns and practices that led to successful API initiatives. Intrigued by his findings author did thorough research of 100's other successful API providers (examples: Facebook, Expedia, Capital One ...) and that resulted in a collection of Best practices and Design patterns that are covered in this course.</p><p>This course covers all the important aspects related to design, development and management of API.&nbsp;The best practices, design patterns, challenges,&nbsp;suggestions &amp;&nbsp;options discussed in this course are either:</p><ul><li><p>Created by analyzing how the popular API&nbsp;providers such as Facebook, Twitter, Capital One etc are building and managing their API</p></li><li><p>Taken from personal experiences of the author</p></li></ul><p><br></p><p><strong>Course is divided into 6 Parts:</strong></p><p><strong>1. Setting the stage - </strong>Discusses a case study (ACME&nbsp;travels) used through the course + provides information on tools used</p><p><strong>2. Evolution of&nbsp; REST API&nbsp;- </strong>Lectures in this section will cover the&nbsp;foundational concepts + Why REST/JSON&nbsp;has become a defacto standard</p><p><strong>3. Designing the REST API</strong><em> (Covered in multiple sections)</em></p><p>This is where students will learn the:</p><ul><li><p>Best Practices</p></li><li><p>Implementation patterns </p></li></ul><p>To demonstrate the implementation aspects, a set of&nbsp;NodeJS&nbsp;based API&nbsp;is also implemented for a fictitious enterprise <em>ACME&nbsp;Travels.</em></p><p>4<strong>. Securing the REST API</strong></p><p>When an API&nbsp;is exposed by an enterprise to the public internet, it poses a risk to the enterprise as hackers may use the vulnerabilities in the API&nbsp;to launch attacks against the enterprise. There are multiple types of such <em>Functional</em> attacks that the API&nbsp;provider must consider. You will learn about the common attacks and the best practices for protecting the API.</p><p>5<strong>. Swagger 2.0 / Open API&nbsp;Initiative specifications</strong><br></p><p>This section will begin with the description of&nbsp;<em>Collaborative</em> specifications development process &amp; benefits of adopting contract first approach. At the end of this section student will be able to write Swagger/OAI&nbsp;specifications for their own API. As part of the lectures, a complete specification will be created for&nbsp;<em>ACME&nbsp;Vacations</em>.&nbsp;</p><p>6<strong>. API&nbsp;Management</strong><br></p><p>API&nbsp;management&nbsp;&nbsp;is the process of publishing, documenting and overseeing application programming interfaces (<strong>APIs</strong>) in a secure, scalable environment. Lectures in this section cover the details of the following activities that an API&nbsp;provider carry out within the scope of API management.</p><p><em>APIgee</em>, <em>IBM&nbsp;API&nbsp;Connect</em> &amp;&nbsp;<em>Mulesoft</em> platforms will be used for demonstrating the various API&nbsp;management aspects discussed in the lectures. Students are encouraged to try out these platforms on their own&nbsp;to get a good feel of what API&nbsp;management platforms bring to table. The three platforms offer a free trial version that can be used for testing.</p><p><br></p><p><strong>WHY&nbsp;REST&nbsp;API?</strong></p><p>Today Enterprises are using REST&nbsp;APIs&nbsp;for not just building mobile applications but also for:</p><ul><li><p>Creating new channels for partnership</p></li><li><p>Building new revenue streams &amp;&nbsp;business models</p></li><li><p>Promoting their brands</p></li></ul><p>Just creating the API&nbsp;does not guarantee that the enterprise will be able to achieve the desired goals from API&nbsp;perspective. Adoption of API&nbsp;by developers depend on multiple aspects&nbsp;such as its utility, ease of use, performance, scalability, security. The API&nbsp;provider must apply best practices throughout the life cycle of an API.</p><p><br></p><p><strong>Who should take this course?</strong></p><p>This course is suited for any technologist interested in learning REST&nbsp;API&nbsp;from end to end perspective not just from&nbsp;the coding perspective. Though this course uses NodeJS&nbsp;for demonstrating the design best practices, it does not require students to have any prior experience wth NodeJS.&nbsp;</p><p>To take this course the student is expected to know any one (or more) programming language;&nbsp;have&nbsp;understanding of web application architecture; to be&nbsp;familiar&nbsp;with the concept of services ; understands the data formats such as JSON&nbsp;or XML</p><p>Please note that this course will NOT&nbsp;teach&nbsp;how to code REST&nbsp;API&nbsp;in NodeJS.</p>",
        "completion_ratio": 30,
        "last_accessed_time": "2022-03-11T06:01:54Z",
        "enrollment_time": "2021-11-18T19:28:57Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 3848374,
        "title": "Data Engineering Essentials using SQL, Python, and PySpark",
        "url": "/course/data-engineering-essentials-sql-python-and-spark/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 22663786,
            "title": "Durga Viswanatha Raju Gadiraju",
            "name": "Durga Viswanatha Raju",
            "display_name": "Durga Viswanatha Raju Gadiraju",
            "job_title": "CEO at ITVersity and CTO at Analytiqs, Inc"
          },
          {
            "_class": "user",
            "id": 168136156,
            "title": "Asasri Manthena",
            "name": "Asasri",
            "display_name": "Asasri Manthena",
            "job_title": "Marketing and Sales Manager at ITVersity, Inc"
          }
        ],
        "published_title": "data-engineering-essentials-sql-python-and-spark",
        "tracking_id": "RfRU9zMMTsW-z5_hVwpWEw",
        "description": "<p>As part of this course, you will learn all the Data Engineering Essentials related to building Data Pipelines using SQL, Python as Hadoop, Hive, or Spark SQL as well as PySpark Data Frame APIs. You will also understand the development and deployment lifecycle of Python applications using Docker as well as PySpark on multinode clusters. You will also gain basic knowledge about reviewing Spark Jobs using Spark UI.</p><p><strong>About Data Engineering</strong></p><p>Data Engineering is nothing but processing the data depending on our downstream needs. We need to build different pipelines such as Batch Pipelines, Streaming Pipelines, etc as part of Data Engineering. All roles related to Data Processing are consolidated under Data Engineering. Conventionally, they are known as ETL&nbsp;Development, Data Warehouse Development, etc.</p><p>Here are <strong>some of the challenges the learners have to face</strong> to learn <strong><em>key Data Engineering Skills such as Python, SQL, PySpark, etc</em></strong>.</p><ul><li><p>Having an appropriate environment with Apache Hadoop, Apache Spark, Apache Hive, etc working together.</p></li><li><p>Good quality content with proper support.</p></li><li><p>Enough tasks and exercises for practice</p></li></ul><p>This course is designed to address these key challenges for professionals at all levels to acquire the required <strong>Data Engineering Skills (Python, SQL, and Apache Spark)</strong>.</p><p>To make sure you spend time learning rather than struggling with technical challenges, here is what we have done.</p><ul><li><p>Training using an interactive environment. <strong>You will get 2 weeks of lab access, to begin with</strong>. If you like the environment and <strong>acknowledge it by providing ratings and feedback, the lab access will be extended to additional 6 weeks</strong> (2 months). Feel free to send an email to support@itversity.com to get complementary lab access. Also, if your employer provides a multi-node environment, we will help you set up the material for the practice as part of the live session. On top of Q&amp;A Support, we also provide required support via live sessions.</p></li><li><p>Make sure we have a system with the right configuration and quickly set up a lab using Docker with all the required Python, SQL, Pyspark as well as Spark SQL&nbsp;material. It will address a lot of pain points related to networking, database integration, etc. Feel free to reach out to us via Udemy Q&amp;A, in case you struck at the time of setting up the environment.</p></li><li><p>You will start with foundational skills such as <strong>Python</strong> as well as <strong>SQL</strong> using a Jupyter-based environment<strong>. </strong>Most of the lecturers have quite a few tasks and also at the end of each and every module, there are enough <strong>exercises</strong> or <strong>practice tests</strong> to evaluate the skills taught.</p></li><li><p>Once you are comfortable with programming using Python and SQL, then you will ensure you understand how to quickly set up and access <strong>Single Node Hadoop and Spark Cluster</strong>.</p></li><li><p>The content is streamlined in such a way that, you use learner-friendly interfaces such as <strong>Jupyter Lab</strong> to practice them.</p></li></ul><p>If you end up signing up for the course do not forget to rate us 5* if you like the content. If not, feel free to reach out to us and we will address your concerns.</p><p><strong>Highlights of this course</strong></p><p>Here are some of the highlights of this Data Engineering course using technologies such as Python, SQL, Hadoop, Spark, etc.</p><ul><li><p>The course is designed by 20+ years of experienced veteran (<strong>Durga Gadiraju</strong>) with most of his experience around data. He has more than a decade of Data Engineering as well as Big Data experience with several certifications. He has a history of training hundreds of thousands of IT professionals in Data Engineering as well as Big Data.</p></li><li><p>Simplified setup of all the key tools to learn Data Engineering or Big Data such as Hadoop, Spark, Hive, etc.</p></li><li><p>Dedicated support where 100% of questions are answered in the past few months.</p></li><li><p>Tons of material with real-world experiences and Data Sets. The material is made available both under the Git repository as well as in the lab which you are going to set up.</p></li><li><p><strong>Complementary Lab Access for 2 Weeks which can be extended to 8 Weeks.</strong></p></li><li><p><strong>30 Day Money back guarantee</strong>.</p></li></ul><p><strong>Content Details</strong></p><p>As part of this course, you will be learning Data Engineering Essentials such as SQL, and Programming using Python and Apache Spark. Here is the detailed agenda for the course.</p><ul><li><p><strong>Data Engineering Labs - Python and SQL</strong></p></li></ul><p>You will start with setting up self-support Data Engineering Labs on Cloud9 or on your Mac or PC so that you can learn the key skills related to Data Engineering with a lot of practice leveraging tasks and exercises provided by us. As you pass the sections related to SQL&nbsp;and Python, you will also be guided to set up Hadoop and Spark Lab.</p><ol><li><p>Provision AWS Cloud9 Instance (in case your Mac or PC does not have enough capacity)</p></li><li><p><strong>Setup Docker Compose</strong> to start the containers to learn <strong>Python</strong> and <strong>SQL</strong> (using Postgresql)</p></li><li><p>Access the material via Jupyter Lab environment setup using Docker and learn via hands-on practice.</p></li></ol><p>Once the environment is set up, the material will be directly accessible.</p><ul><li><p><strong>Database Essentials - SQL&nbsp;using Postgres</strong></p></li></ul><p>It is important for one to be proficient with SQL&nbsp;to take care of building data engineering pipelines. SQL&nbsp;is used for understanding the data, performing ad-hoc analysis, and also in building data engineering pipelines.</p><ol><li><p>Getting Started with Postgres</p></li><li><p><strong>Basic Database Operations (CRUD or Insert, Update, Delete)</strong></p></li><li><p>Writing Basic SQL Queries (<strong>Filtering, Joins, and Aggregations</strong>)</p></li><li><p><strong>Creating Tables and Indexes</strong> using Postgres DDL&nbsp;Commands</p></li><li><p><strong>Partitioning Tables and Indexes</strong> using Postgres DDL&nbsp;Commands</p></li><li><p><strong>Predefined Functions using SQL </strong>(String Manipulation, Date Manipulation, and other functions)</p></li><li><p>Writing <strong>Advanced SQL Queries</strong> using Postgresql</p></li></ol><ul><li><p><strong>Programming Essentials using Python</strong></p></li></ul><p>Python is the most preferred programming language to develop data engineering applications. As part of several sections related to Python, you will be learning most of the important aspects of Python to build data engineering applications effectively.</p><ol><li><p>Perform Database Operations</p></li><li><p>Getting Started with Python</p></li><li><p><strong>Basic Programming Constructs</strong> in Python (<strong>for loops, if conditions</strong>)</p></li><li><p><strong>Predefined Functions</strong> in Python (<strong>string manipulation, date manipulation, and other standard functions</strong>)</p></li><li><p>Overview of <strong>Collections such as list and set</strong> in Python</p></li><li><p>Overview of <strong>Collections such as dict and tuple</strong> in Python</p></li><li><p><strong>Manipulating Collections using loops</strong> in Python. This is primarily designed to get <strong>enough practice with Python Programming around Python Collections</strong>.</p></li><li><p>Understanding <strong>Map Reduce Libraries</strong> in Python. You will learn functions such as <strong>map, filter</strong>, etc. You will also understand details about <strong>itertools</strong>.</p></li><li><p>Overview of <strong>Python Pandas Libraries</strong>. You will be learning about <strong>how to read from files, and processing the data in Pandas Data Frame by applying Standard Transformations such as filtering, joins, sorting, etc</strong>. Also,<strong> you'll be learning how to write data to files. </strong></p></li><li><p><strong>Database Programming</strong> using Python - <strong>CRUD Operations</strong></p></li><li><p><strong>Database Programming</strong> using Python - <strong>Batch Operations</strong>. There will be enough emphasis on best practices to load data into Databases in bulk or batches.</p></li></ol><ul><li><p><strong>Setting up Single Node Data Engineering Cluster for Practice</strong></p></li></ul><p>The most common approach to building data engineering applications at scale is by using Apache Spark integrated with HDFS and YARN. Before getting into data engineering using Apache Spark and Hadoop, we need to set up an environment to practice data engineering using Apache Spark. As part of this section, we will primarily focus on setting up a single node cluster to learn key skills related to data engineering using distributed frameworks such as Apache Spark and Apache Hadoop.</p><p>We have simplified the complex tasks of setting up Apache Hadoop, Apache Hive, and Apache Spark leveraging Docker. Within an hour without running into too many technical issues, you will be able to set up the cluster. However, if you run into any issues, feel free to reach out to us and we will help you to overcome the challenges.</p><ul><li><p><strong>Master required Hadoop Skills to build Data Engineering Applications</strong></p></li></ul><p>As part of this section, you will primarily focus on HDFS&nbsp;commands so that we can copy files into HDFS. The data copied into HDFS will be used as part of building data engineering pipelines using Spark and Hadoop with Python as a Programming Language.</p><ol><li><p>Overview of HDFS&nbsp;Commands</p></li><li><p>Copy Files into HDFS&nbsp;using put or copyFromLocal command using appropriate HDFS&nbsp;Commands</p></li><li><p>Review whether the files are copied properly or not to HDFS&nbsp;using HDFS&nbsp;Commands.</p></li><li><p>Get the size of the files using HDFS commands such as du, df, etc.</p></li><li><p>Some fundamental concepts related to HDFS such as block size, replication factor, etc.</p></li></ol><ul><li><p><strong>Data Engineering using Spark SQL</strong></p></li></ul><p>Let us, deep-dive into Spark SQL to understand how it can be used to build Data Engineering Pipelines. Spark with SQL&nbsp;will provide us the ability to leverage distributed computing capabilities of Spark coupled with easy-to-use developer-friendly SQL-style syntax.</p><ol><li><p>Getting Started with <strong>Spark SQL</strong></p></li><li><p><strong>Basic Transformations</strong> using <strong>Spark SQL</strong></p></li><li><p><strong>Managing Tables</strong> - Basic DDL and DML in <strong>Spark SQL</strong></p></li><li><p><strong>Managing Tables</strong> - DML and Create Partitioned Tables using <strong>Spark SQL</strong></p></li><li><p>Overview of <strong>Spark SQL Functions to manipulate strings, dates, null values</strong>, etc</p></li><li><p>Windowing Functions using Spark SQL for ranking, advanced aggregations, etc.</p></li></ol><ul><li><p><strong>Data Engineering using Spark Data Frame APIs</strong></p></li></ul><p>Spark Data Frame APIs are an alternative way of building Data Engineering applications at scale leveraging distributed computing capabilities of Apache Spark. Data Engineers from application development backgrounds might prefer Data Frame APIs over Spark SQL to build Data Engineering applications.</p><ol><li><p>Data Processing Overview using <strong>Spark or Pyspark Data Frame APIs</strong>.</p></li><li><p><strong>Projecting or Selecting data from Spark Data Frames, renaming columns, providing aliases, dropping columns from Data Frames</strong>, etc using Pyspark Data Frame APIs.</p></li><li><p><strong>Processing Column Data </strong>using Spark or Pyspark Data Frame APIs - You will be learning functions to <strong>manipulate strings, dates, null values</strong>, etc.</p></li><li><p><strong>Basic Transformations</strong> on Spark Data Frames using Pyspark Data Frame APIs such as <strong>Filtering, Aggregations, and Sorting using functions such as filter/where, groupBy with agg, sort or orderBy</strong>, etc.</p></li><li><p><strong>Joining Data Sets</strong> on Spark Data Frames using Pyspark Data Frame APIs such as join. You will learn <strong>inner joins, outer joins</strong>, etc using the right examples.</p></li><li><p><strong>Windowing Functions</strong> on Spark Data Frames using Pyspark Data Frame APIs to perform advanced <strong>Aggregations, Ranking, and Analytic Functions</strong></p></li><li><p><strong>Spark Metastore Databases and Tables</strong> and <strong>integration between Spark SQL&nbsp;and Data Frame APIs</strong></p></li></ol><ul><li><p><strong>Development, Deployment as well as Execution Life Cycle of Spark Applications</strong></p></li></ul><p>Once you go through the content related to Apache Spark using a Jupyter-based environment, we will also walk you through the details about how the Spark applications are typically developed using Python, deployed as well as reviewed.</p><ol><li><p>Setup <strong>Python Virtual Environment and Project</strong> for <strong>Spark Application Development using Pycharm</strong></p></li><li><p>Understand complete <strong>Spark Application Development Lifecycle</strong> using Pycharm and Python</p></li><li><p><strong>Build a zip file for the Spark Application</strong>, copy it to the environment where it is supposed to run, and run.</p></li><li><p>Understand how to review the <strong>Spark Application Execution Life Cycle</strong>.</p></li></ol><p><strong>Desired Audience for this Data Engineering Essentials course</strong></p><p>People from different backgrounds can aim to become Data Engineers. We cover most of the Data Engineering essentials for the aspirants who want to get into the IT field as Data Engineers as well as professionals who want to propel their career toward Data Engineering from legacy technologies.</p><ul><li><p>College students and entry-level professionals to get hands-on expertise with respect to Data Engineering. This course will provide enough skills to face interviews for entry-level data engineers.</p></li><li><p>Experienced application developers to gain expertise related to Data Engineering.</p></li><li><p>Conventional Data Warehouse Developers, ETL&nbsp;Developers, Database Developers, and PL/SQL&nbsp;Developers to gain enough skills to transition to being successful Data Engineers.</p></li><li><p>Testers to improve their testing capabilities related to Data Engineering applications.</p></li><li><p>Other hands-on IT Professional who wants to get knowledge about Data Engineering with Hands-On Practice.</p></li></ul><p><strong>Prerequisites to practice Data Engineering Skills</strong></p><p>Here are the prerequisites for someone who wants to be a Data Engineer.</p><ul><li><p>Logistics</p><ul><li><p>Computer with decent configuration (At least 4 GB RAM, however 8 GB&nbsp;is highly desired). However, this will not suffice if you do not have a multi-node cluster. We will walk you through the cheaper options to set up the environment and practice.</p></li><li><p>Dual Core is required and Quad-Core is highly desired</p></li><li><p>Chrome Browser</p></li><li><p>High-Speed Internet</p></li></ul></li><li><p>Desired Background</p><ul><li><p>Engineering or Science Degree</p></li><li><p>Ability to use computer</p></li><li><p>Knowledge or working experience with databases and any programming language is highly desired</p></li></ul></li></ul><p><strong>Training Approach for learning required Data Engineering Skills</strong></p><p>Here are the details related to the training approach for you to master all the key Data Engineering Skills to propel your career toward Data Engineering.</p><ul><li><p>It is self-paced with reference material, code snippets, and videos provided as part of Udemy.</p></li><li><p>One can either use the environment provided by us or set up their own environment using Docker on AWS&nbsp;or GCP or the platform of their choice.</p></li><li><p>We would recommend completing <strong>2 modules every week</strong> by spending <strong>4 to 5 hours per week</strong>.</p></li><li><p>It is highly recommended to take care of the exercises at the end to ensure that you are able to meet all the key objectives for each module.</p></li><li><p>Support will be provided through Udemy Q&amp;A.</p></li></ul><p>The course is designed in such a way that one can self-evaluate through the course and confirm whether the skills are acquired.</p><ul><li><p>Here is the approach we recommend you to take this course.</p><ul><li><p>The course is hands-on with thousands of tasks, you should practice as you go through the course.</p></li><li><p>You should also spend time understanding the concepts. If you do not understand the concept, I would recommend moving on and coming back later to the topic.</p></li><li><p>Go through the consolidated exercises and see if you are able to solve the problems or not.</p></li><li><p>Make sure to follow the order we have defined as part of the course.</p></li><li><p>After each and every section or module, make sure to solve the exercises. We have provided enough information to validate the output.</p></li></ul></li><li><p>By the end of the course, then you can come to the conclusion that you are able to master essential skills related to SQL, Python, and Apache Spark.</p></li></ul>",
        "completion_ratio": 0,
        "last_accessed_time": "2022-03-11T06:00:50Z",
        "enrollment_time": "2021-10-18T05:24:50Z",
        "num_collections": 0
      },
      {
        "_class": "course",
        "id": 359550,
        "title": "Master Object Oriented Design in Java - Homework + Solutions",
        "url": "/course/mastering-object-oriented-design-in-java/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 7315098,
            "title": "Imtiaz Ahmad",
            "name": "Imtiaz",
            "display_name": "Imtiaz Ahmad",
            "job_title": "Senior Software Engineer & Trainer @ Job Ready Programmer"
          }
        ],
        "published_title": "mastering-object-oriented-design-in-java",
        "tracking_id": "Kt4JEUUCSRKxpKoDNl8ccA",
        "description": "<p><strong>LAST&nbsp;UPDATED:&nbsp;November&nbsp;2021</strong></p><p><br></p><p><strong>SUPER CHARGE OF YOUR PROGRAMMING CAREER and acquire some seriously marketable skills!</strong></p><p>&nbsp; \t&nbsp; Just because you learned how to use a hammer doesn't mean you are ready to construct a building. Similarly, It's not enough to just understand a programming language. That's just a tool that can be used to develop various programs. The <strong>real craftsmanship is in software DESIGN</strong>.&nbsp; </p><p>&nbsp; \t&nbsp; This course is designed to take a junior level programmer with limited knowledge about object orientation to a competent level object oriented software designer! I expect you to understand the basics of loops, methods and conditionals in Java. <strong>You'll be</strong> <strong>completing hands-on HOMEWORK Exercises </strong>through out the course! I have provided <strong>detailed video solutions to the exercises</strong> so that you can check your answers and get step by step instructions of how to tackle the object oriented design assignments.&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; You can find plenty of resources online for solving a programming puzzle&nbsp; or practicing algorithms. But… when it comes to object oriented design,&nbsp; admittedly, there is limited material out there for you to practice. So&nbsp; in this course, we use a<strong> LEARN-BY-DOING</strong>&nbsp; approach to explore a series of progressively challenging exercises to&nbsp; discover the 5 core object oriented design PRINCIPLES summarized by an&nbsp; acronym called SOLID:&nbsp; </p><p>&nbsp; \t<strong>(S). Single Responsibility&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; (O). Open/Closed&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; (L).&nbsp; Liskov Substitution&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; (l ). Interface Segregation&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; (D). Dependency Inversion&nbsp; </strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; During this journey you'll get practice applying some of the most important <strong>DESIGN PATTERNS</strong> that competent developers must have under their belt. There are so many design patterns out there, but we'll be thoroughly covering only the most important ones. Save yourself the time from learning all the design patterns and going on a design frenzy. Focus on the 20% that covers 80% of the scenarios and add miles to your programming efficiency.&nbsp; </p><p>&nbsp; \t<strong><em>These cover 80% of patterns used out there in professional software development.&nbsp; </em></strong>&nbsp; </p><p>&nbsp; \t<strong>1). Strategy Pattern&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; 2). Observer Pattern&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; 3). Builder pattern&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; 4). Factory method pattern&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; 5). Template Method Pattern&nbsp; </strong>&nbsp; </p><p>&nbsp; \t<strong>6). Singleton Pattern</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The topics can be applied to pretty much any object oriented language.<strong> But, we'll be using Java, so I expect you to be familiar with the basic language constructs such as classes, methods and interfaces. </strong>But don't worry if you don't know about these, I've taken the time to create 6 comprehensive prerequisite lessons on introduction to object orientation. In these lessons, new comers can learn about the basics of object orientation such as:&nbsp; </p><p>&nbsp; \t<strong><em>1). Classes and objects&nbsp; </em></strong>&nbsp; </p><p>&nbsp; \t<strong><em>&nbsp; &nbsp; &nbsp; &nbsp; 2). Inheritance and polymorphism,&nbsp; </em></strong>&nbsp; </p><p>&nbsp; \t<strong><em>&nbsp; &nbsp; &nbsp; &nbsp; 3). Interfaces and abstract classes.&nbsp; </em></strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; I'm certain that, by practicing the concepts covered, you'll make a substantial leap forward in your programming career. I hope to see you in the coming lessons. </p><p>This course is from&nbsp;This site offers lectures on practical software development topics to immediately impact your programming skills. Things you can take to your interview and feel confident in your abilities!</p>",
        "completion_ratio": 5,
        "last_accessed_time": "2022-03-11T05:58:59Z",
        "enrollment_time": "2021-10-18T05:24:51Z",
        "num_collections": 1
      },
      {
        "_class": "course",
        "id": 2241936,
        "title": "Java Application Performance Tuning and Memory Management",
        "url": "/course/java-application-performance-and-memory-management/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 9244826,
            "title": "Matt Greencroft",
            "name": "Matt",
            "display_name": "Matt Greencroft",
            "job_title": "Course tutor at Virtual Pair Programmers"
          },
          {
            "_class": "user",
            "id": 49202064,
            "title": "Virtual Pair Programmers",
            "name": "Virtual Pair",
            "display_name": "Virtual Pair Programmers",
            "job_title": ""
          }
        ],
        "published_title": "java-application-performance-and-memory-management",
        "tracking_id": "AS9JuOCfQzWrbJP9dXVCNg",
        "description": "<p>In this course we'll understand what can cause performance issues in our applications, and how to resolve them. This includes a review of some of the options available to us as developers at design-time - how to make good coding choices for optimal performance. For example, when should you pick an ArrayList over a LinkedList?&nbsp;How much difference does the StringBuilder really make? Is Lambda syntax more or less efficient at certain operations?&nbsp; We'll also learn about various ways that we can configure the virtual machine to provide better performance at run-time, with a range of runtime arguments. We'll also be diving deep into how the virtual machine manages memory, and how the garbage collection process works and impacts on application performance.</p><p>Along the way we'll be learning about the Just In Time compiler, performance testing and benchmarking, decompiling bytecode, using the GraalVM as an alternative virtual machine and more.</p><p><strong>About Java Versions:&nbsp;</strong>This is the second iteration of this course and it is designed for all the current versions of Java that have long term support (Java 8 , Java 11 and Java 17). You can follow along with any of these versions. You can also use either the Oracle or the OpenJDK&nbsp;JVMs.&nbsp; For developers using other JVM&nbsp;languages (such as Kotlin, Scala and Groovy) all of the JVM&nbsp;configuration parts of this course will still be relevant, and some of the coding choices may be useful to consider also. (Note that there's even a review of whether Kotlin provides better or worse performance than Java!) </p>",
        "completion_ratio": 10,
        "last_accessed_time": "2022-03-11T05:58:39Z",
        "enrollment_time": "2021-12-03T11:54:11Z",
        "num_collections": 1
      },
      {
        "_class": "course",
        "id": 684824,
        "title": "Spring Framework Master Class - Java Spring the Modern Way",
        "url": "/course/spring-tutorial-for-beginners/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 13363166,
            "title": "in28Minutes Official",
            "name": "in28Minutes",
            "display_name": "in28Minutes Official",
            "job_title": "DevOps, Azure, GCP, Docker, Kubernetes, Java & Spring Boot"
          }
        ],
        "published_title": "spring-tutorial-for-beginners",
        "tracking_id": "Z25GfxreTyysOipb81pSqA",
        "description": "<p>Do you want to become an Expert on the Spring Framework?&nbsp; Do you want to become a <strong>Modern Spring Developer</strong>? Join the course to <strong>learn Spring Framework the Modern Way</strong> - The way <strong>Real World Java Projects</strong> use it! </p><p>Learn the <strong>magic of Spring Framework</strong>. From IOC (Inversion of Control), DI (Dependency Injection), Application Context to the <strong>world of Java Spring Boot, Spring AOP</strong>, Spring JDBC and JPA. <strong>Get set for an incredible journey.</strong></p><p><br></p><p><strong>WHAT&nbsp;OUR&nbsp;LEARNERS&nbsp;ARE&nbsp;SAYING:</strong></p><p><strong>5 STARS&nbsp;- </strong>This is so far the <strong>best Spring course</strong> I have been taking. Start from simple and easy, yet in-depth explanation. <strong>Really well-designed</strong>! Recommend to anyone like me that have a medium java background (learned from school class), but completely new to Spring. And it is also a great practice for what I learned from our OOAD course at school. Now it is crystal clear to me!! <strong>Highly recommended!</strong></p><p><strong>5 STARS&nbsp;- </strong>Excellent <strong>In-depth</strong>, <strong>Real World</strong> Oriented Course with Excellent teaching style with crystal clear explanations - in general a course cannot be better than this in my opinion. <strong>Thank you for this superb training experience</strong> Ranga.</p><p><strong>5 STARS&nbsp;- <em>The instructor is very knowledgeable,</em></strong><em> and what makes this course a winner is the scope of each example along with its explanation. The lectures are short, and enough to introduce and understand the topic to make it functional. It really helps that it is hands-on, and I had no trouble or errors running any of the code. You learn the essentials to work with Spring, but also guides you through Eclipse and shortcuts which are very useful. The pace and length of the lectures are perfect! Extremely well done! This knowledge would have taken me a lot longer to learn were it not for this course, Thank you Ranga!</em></p><p><strong>5 STARS&nbsp;- </strong><em>I know a lot more </em><strong><em>about dependency injection, IOC, loose-coupling, and application context </em></strong><em>thanks to Ranga. He has changed my life. I am now more knowledgeable about Spring framework and am really confident in my interviews. He deserves every penny from me and needs to become a millionaire for </em><strong><em>making me position myself to potentially becoming a Spring Guru</em></strong><em>.</em></p><p><strong>5 STARS&nbsp;- </strong><em>This course shifted me to a </em><strong><em>new level of understanding Spring</em></strong><em>. Great tutor.</em></p><p><strong>5 STARS&nbsp;- </strong>Great course and to the point, which is helpful if you need to brush up/learn all you need fast all while understanding the fundamental concepts about spring/spring mvc/spring boot and their related technologies.</p><p><br></p><p><strong>COURSE&nbsp;OVERVIEW:</strong></p><p>In this course, you will learn the features of&nbsp;<strong>Spring, Spring Boot&nbsp;and Spring Modules - JDBC, AOP, Data&nbsp;JPA</strong>&nbsp;with hands-on step by step approach.</p><p>You will get&nbsp;introduced to Spring Boot, Unit Testing with JUnit and Mockito, talking to the database with Spring JDBC&nbsp;and JPA,&nbsp;Maven (dependencies management), Eclipse (IDE) and Tomcat Embedded Web Server. <strong>We will help you set up each one of these.</strong></p><p><strong>You will learn about Spring&nbsp;step by step - in more than 100&nbsp;steps.</strong> This course would be a perfect first step as an introduction to Spring.</p><p><strong>You will learn about</strong></p><ul><li><p>Basics of Spring Framework - Dependency Injection, IOC Container, Application Context and Bean Factory.</p></li><li><p>Spring Annotations - @Autowired, @Component, @Service, @Repository, @Configuration, @Primary....</p></li><li><p>Spring MVC in depth - DispatcherServlet , Model, Controllers and ViewResolver</p></li><li><p>Spring Boot Starters - Spring Boot Starter Web, Starter Data Jpa, Starter Test</p></li><li><p>Basics of Spring Boot, Spring AOP, Spring JDBC and JPA</p></li><li><p>Basics of Eclipse, Maven, JUnit and Mockito</p></li><li><p>Basic concept of a Web application step by step using JSP Servlets and Spring MVC</p></li><li><p>Unit testing with JUnit and Mockito using XML and Java Spring Application Contexts</p></li></ul><p><br></p><p><strong>COURSE&nbsp;HIGHLIGHTS:</strong></p><p><br></p><p><strong>Level 1 :&nbsp;Spring Framework in 10 Steps</strong></p><ol><li><p>Step 1 - Setting up a Spring Project</p></li><li><p>Step 2 - Understanding Tight Coupling using the Binary Search Algorithm Example</p></li><li><p>Step 3 - Making the Binary Search Algorithm Example Loosely Coupled</p></li><li><p>Step 4 - Using Spring to Manage Dependencies - @Component, @Autowired</p></li><li><p>Step 5 - What is happening in the background?</p></li><li><p>Step 6 - Dynamic auto wiring and Troubleshooting - @Primary</p></li><li><p>Step 7 - Constructor and Setter Injection</p></li><li><p>Step 8 - Spring Modules</p></li><li><p>Step 9 - Spring Projects</p></li><li><p>Step 10 - Why is Spring Popular?</p></li></ol><p><strong>Level 2&nbsp;:&nbsp;Spring in Depth</strong></p><ol><li><p>Step 11 - Dependency Injection - A few more examples</p></li><li><p>Step 12 - Autowiring in Depth - by Name and @Primary</p></li><li><p>Step 13 - Autowiring in Depth - @Qualifier annotation</p></li><li><p>Step 14 - Scope of a Bean - Prototype and Singleton</p></li><li><p>Step 15 - Complex scenarios with Scope of a Spring Bean - Mix of Prototype and Singleton</p></li><li><p>Step 15B - Difference Between Spring Singleton and GOF Singleton</p></li><li><p>Step 16 - Using Component Scan to scan for beans</p></li><li><p>Step 17 - Lifecycle of a Bean - @PostConstruct and @PreDestroy</p></li><li><p>Step 18 - Container and Dependency Injection (CDI) - @Named, @Inject</p></li><li><p>Step 19 - Removing Spring Boot in Basic Application</p></li><li><p>Step 20 - Fixing minor stuff - Add Logback and Close Application Context</p></li><li><p>Step 21 - Defining Spring Application Context using XML - Part 1</p></li><li><p>Step 22 - Defining Spring Application Context using XML - Part 2</p></li><li><p>Step 23 - Mixing XML Context with Component Scan for Beans defined with Annotations</p></li><li><p>Step 24 - IOC Container vs Application Context vs Bean Factory</p></li><li><p>Step 25 - @Component vs @Service vs @Repository vs @Controller</p></li><li><p>Step 26 - Read values from external properties file</p></li></ol><p><strong>Level 3 has 3 steps on Unit&nbsp;Tests with Java and XML&nbsp;Contexts<br></strong></p><p><strong>Level 4&nbsp;:&nbsp;Spring Boot in 10 Steps</strong></p><ol><li><p>Step 1 : Introduction to Spring Boot - Goals and Important Features</p></li><li><p>Step 2 : Developing Spring Applications before Spring Boot</p></li><li><p>Step 3 : Using Spring Initializr to create a Spring Boot Application</p></li><li><p>Step 4 : Creating a Simple REST Controller</p></li><li><p>Step 5 : What is Spring Boot Auto Configuration?</p></li><li><p>Step 6 : Spring Boot vs Spring vs Spring MVC</p></li><li><p>Step 7 : Spring Boot Starter Projects - Starter Web and Starter JPA</p></li><li><p>Step 8 : Overview of different Spring Boot Starter Projects</p></li><li><p>Step 9 : Spring Boot Actuator</p></li><li><p>Step 10 : Spring Boot Developer Tools</p></li></ol><p><strong>Level 5&nbsp;:&nbsp;Spring AOP</strong></p><ol><li><p>Step 01 - Setting up AOP Example - Part 1</p></li><li><p>Step 02 - Setting up AOP Example - Part 2</p></li><li><p>Step 03 - Defining an @Before advice</p></li><li><p>Step 04 - Understand AOP Terminology - Pointcut, Advice, Aspect, Join Point, Weaving and Weaver</p></li><li><p>Step 05 - Using @After, @AfterReturning, @AfterThrowing advices</p></li><li><p>Step 06 - Using @Around advice to implement performance tracing</p></li><li><p>Step 07 - Best Practice : Use common Pointcut Configuration</p></li><li><p>Step 08 - Quick summary of other Pointcuts</p></li><li><p>Step 09 - Creating Custom Annotation and an Aspect for Tracking Time</p></li></ol><p><strong>Level 6&nbsp;:Spring JDBC and JPA</strong></p><ol><li><p>Step 01 - Setting up a project with JDBC, JPA, H2 and Web Dependencies</p></li><li><p>Step 02 - Launching up H2 Console</p></li><li><p>Step 03 - Creating a Database Table in H2</p></li><li><p>Step 04 - Populate data into Person Table</p></li><li><p>Step 05 - Implement findAll persons Spring JDBC Query Method</p></li><li><p>Step 06 - Execute the findAll method using CommandLineRunner</p></li><li><p>Step 07 - A Quick Review - JDBC vs Spring JDBC</p></li><li><p>Step 08 - Whats in the background? Understanding Spring Boot Autoconfiguration</p></li><li><p>Step 09 - Implementing findById Spring JDBC Query Method</p></li><li><p>Step 10 - Implementing deleteById Spring JDBC Update Method</p></li><li><p>Step 11 - Implementing insert and update Spring JDBC Update Methods</p></li><li><p>Step 12 - Creating a custom Spring JDBC RowMapper</p></li><li><p>Step 13 - Quick introduction to JPA</p></li><li><p>Step 14 - Defining Person Entity</p></li><li><p>Step 15 - Implementing findById JPA Repository Method</p></li><li><p>Step 16 - Implementing insert and update JPA Repository Methods</p></li><li><p>Step 17 - Implementing deleteById JPA Repository Method</p></li><li><p>Step 18 - Implementing findAll using JPQL Named Query</p></li><li><p>Step 19 - Introduction to Spring Data JPA</p></li><li><p>Step 20 - Connecting to Other Databases</p></li></ol><p><strong>Start Learning Now.</strong> Hit the Enroll Button!</p><p><br></p><p><br></p>",
        "completion_ratio": 15,
        "last_accessed_time": "2022-03-11T05:57:56Z",
        "enrollment_time": "2021-06-22T08:18:16Z",
        "num_collections": 1
      },
      {
        "_class": "course",
        "id": 1078208,
        "title": "Learn Spring Boot in 100 Steps - No 1 Java Framework",
        "url": "/course/spring-boot-tutorial-for-beginners/learn/",
        "visible_instructors": [
          {
            "_class": "user",
            "id": 13363166,
            "title": "in28Minutes Official",
            "name": "in28Minutes",
            "display_name": "in28Minutes Official",
            "job_title": "DevOps, Azure, GCP, Docker, Kubernetes, Java & Spring Boot"
          }
        ],
        "published_title": "spring-boot-tutorial-for-beginners",
        "tracking_id": "0lnmjo6KSRyt94UiZkS95A",
        "description": "<p><strong>UPDATE:</strong>&nbsp; <strong>C<em>ourse re-recorded with Spring Boot 3!</em></strong></p><p>Spring Boot is the <strong>No 1 Java Framework</strong> for Building Microservices and REST&nbsp;API. </p><p>Do you want to <strong>Learn</strong> the <strong>Magic of Spring Boot</strong> - Auto Configuration, Spring Initializr and Starter Projects?&nbsp;</p><p>Do you want to build an <strong>Awesome Web Application</strong> connecting to a <strong>Database</strong> with <strong>JPA/Hibernate</strong> using <strong>SpringBoot</strong>?&nbsp;</p><p>Do you want to build a <strong>Basic REST&nbsp;API</strong> using Spring Boot? </p><p>Look No Further!</p><p><br></p><p><strong>WHAT&nbsp;OUR&nbsp;LEARNERS&nbsp;ARE&nbsp;SAYING:</strong></p><p><strong>5 STARS&nbsp;- <em>This course was perfect not only for beginners but for experienced engineers </em></strong><em>such as myself trying to get up to speed on spring boot quickly. Thank you so much for the great material! Looking forward to taking another course from udemy and in28minutes!</em></p><p><strong>5 STARS&nbsp;- </strong><em>One of the </em><strong><em>best Spring Boot course</em></strong><em>!</em></p><p><strong>5 STARS&nbsp;- </strong><em>I found this course to be very thorough. </em><strong><em>Good balance of theory and hands-on coding</em></strong><em>. Every important aspect of Spring Boot is demonstrated by way of useful, almost </em><strong><em>production grade coding exercises, unit and integration testing</em></strong><em>. This course has </em><strong><em>everything you would require to get up and running as spring boot developer</em></strong><em>. I liked this course and </em><strong><em>recommend highly</em></strong><em> to anyone interested in learning about Spring Boot.</em></p><p><strong>5 STARS&nbsp;- </strong><em>This is the one of the </em><strong><em>best spring boot courses</em></strong><em> I have enrolled. Ranga Karan explains each and every bit and shows practically. I would recommend to anyone who wants to learn spring boot</em></p><p><strong>5 STARS&nbsp;- </strong><em>Great instructor!!</em></p><p><strong>5 STARS&nbsp;- </strong>I'm a beginner to Spring Boot framework, and I find this tutorial <strong>absolutely awesome</strong>! The instructor's lecture is crystal clear! Thanks for providing this tutorial!!!</p><p><br></p><p><strong>COURSE OVERVIEW:</strong></p><p>Spring Boot has a <strong>lot of magic</strong> going for it. Developing REST&nbsp;Services with Spring Boot&nbsp;is cool and fun.&nbsp;Spring Boot makes it easy to create stand-alone, production-grade Spring based Applications that you can “just run”. Most Spring Boot applications need very little Spring configuration.</p><p><strong>This course is now&nbsp;updated with new sections. Updated with Spring Boot 2 and Spring 5.&nbsp;</strong></p><p>In this course, you will learn the features of&nbsp;Spring Boot and Spring Boot Starter Projects with <strong>hands-on step by step approach</strong> developing:</p><ol><li><p>Basic Todo Management Java&nbsp;Application using Spring Boot with Login and Logout functionalities</p></li><li><p>Basic REST Service to manage Survey Questionnaire&nbsp;</p></li></ol><p>You will get&nbsp;introduced to REST Services, Spring Security (Authentication and Authorization), Maven (dependencies management), Eclipse (IDE) and Tomcat Embedded Web Server. We will help you set up each one of these.</p><p><strong>You will learn about Spring Boot step by step - in more than 100&nbsp;steps.</strong> This course would be a perfect first step as an introduction to Spring Boot.</p><p><strong>You will learn about</strong></p><ul><li><p>Basics of Spring Boot</p></li><li><p>Basics of Auto Configuration and Spring Boot Magic</p></li><li><p>Spring Boot Starter Projects</p></li><li><p>Spring Initializr</p></li><li><p>Basic REST Services using Spring Boot Starter Web</p></li><li><p>REST Service Content Negotiation with JSON and XML</p></li><li><p>Embedded servlet containers : Tomcat, Jetty and Undertow</p></li><li><p>Writing Unit and Integration tests using Spring Boot Starter Test</p></li><li><p>Profiles and Dynamic Configuration with Spring Boot</p></li><li><p>Spring Boot Data JPA</p></li><li><p>Spring Boot Actuator</p></li><li><p>Spring Security</p></li><li><p>Spring Boot Developer Tools</p></li></ul><p><strong>Here is a quick overview of different sections of the course:</strong></p><ul><li><p>Introduction to the Power of Spring Boot in 10 Steps</p></li><li><p>Develop a Todo Management Web Application with Spring Boot in 25&nbsp;Steps</p></li><li><p>Introduction to Unit Testing with JUnit in 5 Steps</p></li><li><p>Introduction to Mocking with Mockito in 5 Steps</p></li><li><p>Advanced Features of Spring Boot in 28&nbsp;Steps - We learn these developing a simple API for managing survey questionnaire.</p></li><li><p>Introduction to JPA in 10 Steps</p></li></ul><p><br></p><p><strong>COURSE&nbsp;HIGHLIGHTS:</strong></p><p><strong>Web Application with Spring Boot </strong></p><p><br></p><ul><li><p>Step 01 - Creating Spring Boot Web Application with Spring Initializr</p></li><li><p>Step 02 - Quick overview of Spring Boot Project</p></li><li><p>Step 03 - First Spring MVC Controller, @ResponseBody, @Controller</p></li><li><p>Step 04 - Enhancing Spring MVC Controller to provide HTML response</p></li><li><p>Step 05 - Redirect to a JSP using Spring Boot - Controller, @ResponseBody and View Resolver</p></li><li><p>Step 06 - Exercise - Creating LoginController and login view</p></li><li><p>Step 07 - Quick Overview - How does web work - Request and Response</p></li><li><p>Step 08 - Capturing QueryParams using RequestParam and First Look at Model</p></li><li><p>Step 09 - Quick Overview - Importance of Logging with Spring Boot</p></li><li><p>Step 10 - Understanding DispatcherServlet, Model 1, Model 2 and Front Controller</p></li><li><p>Step 11 - Creating a Login Form</p></li><li><p>Step 12 - Displaying Login Credentials in a JSP using Model</p></li><li><p>Step 13 - Add hard-coded validation of userid and password</p></li><li><p>Step 14 - Getting started with Todo Features - Creating Todo and TodoService</p></li><li><p>Step 15 - Creating first version of List Todos Page</p></li><li><p>Step 16 - Understanding Session vs Model vs Request - @SessionAttributes</p></li><li><p>Step 17 - Adding JSTL to Spring Boot Project and Showing Todos in a Table</p></li><li><p>Step 18 - Adding Bootstrap CSS framework to Spring Boot Project using webjars</p></li><li><p>Step 19 - Formatting JSP pages with Bootstrap CSS framework</p></li><li><p>Step 20 - Lets Add a New Todo - Create a new View</p></li><li><p>Step 21 - Enhancing TodoService to add the todo</p></li><li><p>Step 22 - Adding Validations using Spring Boot Starter Validation</p></li><li><p>Step 23 - Using Command Beans to implement New Todo Page Validations</p></li><li><p>Step 24 - Implementing Delete Todo Feature - New View</p></li><li><p>Step 25 - Implementing Update Todo - 1 - Show Update Todo Page</p></li><li><p>Step 26 - Implementing Update Todo - 1 - Save changes to Todo</p></li><li><p>Step 27 - Adding Target Date Field to Todo Page</p></li><li><p>Step 28 - Adding a Navigation Bar and Implementing JSP Fragments</p></li><li><p>Step 29 - Preparing for Spring Security</p></li><li><p>Step 30 - Setting up Spring Security with Spring Boot Starter Security</p></li><li><p>Step 31 - Configuring Spring Security with Custom User and Password Encoder</p></li><li><p>Step 32 - Refactoring and Removing Hardcoding of User Id</p></li><li><p>Step 33 - Setting up a New User for Todo Application</p></li><li><p>Step 34 - Adding Spring Boot Starter Data JPA and Getting H2 database ready</p></li><li><p>Step 35 - Configuring Spring Security to Get H2-console Working</p></li><li><p>Step 36 - Making Todo an Entity and Population Todo Data into H2</p></li><li><p>Step 37 - Creating TodoRepository and Connecting List Todos page from H2 database</p></li><li><p>Step 38 - Connecting All Todo App Features to H2 Database</p></li><li><p>Step 39 - OPTIONAL - Overview of Connecting Todo App to MySQL database</p></li><li><p>Step 40 - OPTIONAL - Installing Docker</p></li><li><p>Step 41 - OPTIONAL - Connecting Todo App to MySQL database<strong><br></strong></p></li></ul><p><strong>Spring Boot Deep Dive With a Small API</strong></p><p><br></p><ul><li><p>Step 01 - Quick Introduction to REST - Understand Resource and Actions</p></li><li><p>Step 02 - Creating Spring Boot Project for REST with Maven and Eclipse</p></li><li><p>Step 03 - Creating your first Spring Boot Resource - Hello World</p></li><li><p>Step 04 - Creating a Second Spring Boot Resource Method - Hello World Bean</p></li><li><p>Step 05 - Exploring Path Params and Path Variables with Spring Boot</p></li><li><p>Step 06 - Getting Ready for Survey Questionnaire REST API</p></li><li><p>Step 07 - Creating First Survey Spring Boot REST API - GET all surveys</p></li><li><p>Step 08 - Creating Second Survey Spring Boot REST API Method - GET a survey</p></li><li><p>Step 09 - Exploring REST API Best Practices - Request Methods and Response Status</p></li><li><p>Step 10 - Exercise - Creating Survey Question related Spring Boot REST API Methods</p></li><li><p>Step 11 - Creating Spring Boot REST API to create Survey Question - POST</p></li><li><p>Step 12 - Improving POST Method - Status CREATED and Location Header</p></li><li><p>Step 13 - Implementing Spring Boot REST API Method to DELETE a Question</p></li><li><p>Step 14 - Implementing Spring Boot REST Method to Update a Question - PUT</p></li><li><p>Step 15 - Setting up Spring Boot Data JPA with H2 Database and User Entity</p></li><li><p>Step 16 - Exploring Spring Boot Data JPA using Command Line Runner</p></li><li><p>Step 17 - Creating User REST API with Spring Boot Starter Rest</p></li><li><p>Step 18 - Writing Your First Spring Boot Integration Test</p></li><li><p>Step 19 - Writing Asserts for JSON in Spring Boot Tests - JsonAssert</p></li><li><p>Step 20 - Improving JUnit Asserts for Spring Boot Integration Test</p></li><li><p>Step 21 - Writing Spring Boot Integration Test for GET method returning List</p></li><li><p>Step 22 - Writing Spring Boot Integration Test for POST method creating a Question</p></li><li><p>Step 23 - Understanding JUnit Best Practice - Have ZERO Side Effects</p></li><li><p>Step 24 - Writing Your First Spring Boot Mock MVC Unit Test</p></li><li><p>Step 25 - Improving Asserts for Spring Boot Mock MVC Unit Test</p></li><li><p>Step 26 - Writing Spring Boot Mock MVC Unit Test for POST Method</p></li><li><p>Step 27 - Getting Started with Spring Boot Starter Security</p></li><li><p>Step 28 - Configuring Spring Security for Spring Boot REST API</p></li><li><p>Step 29 - Fixing Spring Boot Unit and Integration Tests</p></li></ul><p><br></p><p><br></p>",
        "completion_ratio": 2,
        "last_accessed_time": "2022-03-11T05:57:41Z",
        "enrollment_time": "2021-06-23T01:27:22Z",
        "num_collections": 1
      }
    ]
  }